#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Дмитрий', 'Николай', 'Татьяна']


# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    [my_family[0], 190],
    [my_family[1], 180],
    [my_family[2], 160]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print('Рост отца - {} см'.format(my_family_height[1][1]))

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
sum_height = my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1]
print('Общий рост моей семьи - {} см'.format(sum_height))